docs/stress-test/results/k6/stage5-k6-full-flow-1vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/rme-full-flow-50-users.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 50s max duration (incl. graceful stop):
              * full_flow_users: 1 looping VUs for 30s (exec: fullFlow, gracefulStop: 20s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   3% ] 1 VUs  01.0s/30s

running (02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   7% ] 1 VUs  02.0s/30s

running (03.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
full_flow_users   [  10% ] 1 VUs  03.0s/30s

running (04.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
full_flow_users   [  13% ] 1 VUs  04.0s/30s

running (05.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
full_flow_users   [  17% ] 1 VUs  05.0s/30s

running (06.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
full_flow_users   [  20% ] 1 VUs  06.0s/30s

running (07.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
full_flow_users   [  23% ] 1 VUs  07.0s/30s

running (08.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
full_flow_users   [  27% ] 1 VUs  08.0s/30s

running (09.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
full_flow_users   [  30% ] 1 VUs  09.0s/30s

running (10.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
full_flow_users   [  33% ] 1 VUs  10.0s/30s

running (11.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
full_flow_users   [  37% ] 1 VUs  11.0s/30s

running (12.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
full_flow_users   [  40% ] 1 VUs  12.0s/30s

running (13.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
full_flow_users   [  43% ] 1 VUs  13.0s/30s

running (14.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
full_flow_users   [  47% ] 1 VUs  14.0s/30s

running (15.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
full_flow_users   [  50% ] 1 VUs  15.0s/30s

running (16.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
full_flow_users   [  53% ] 1 VUs  16.0s/30s

running (17.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
full_flow_users   [  57% ] 1 VUs  17.0s/30s

running (18.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
full_flow_users   [  60% ] 1 VUs  18.0s/30s

running (19.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
full_flow_users   [  63% ] 1 VUs  19.0s/30s

running (20.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
full_flow_users   [  67% ] 1 VUs  20.0s/30s

running (21.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
full_flow_users   [  70% ] 1 VUs  21.0s/30s

running (22.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
full_flow_users   [  73% ] 1 VUs  22.0s/30s

running (23.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
full_flow_users   [  77% ] 1 VUs  23.0s/30s

running (24.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
full_flow_users   [  80% ] 1 VUs  24.0s/30s

running (25.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  83% ] 1 VUs  25.0s/30s

running (26.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  87% ] 1 VUs  26.0s/30s

running (27.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
full_flow_users   [  90% ] 1 VUs  27.0s/30s

running (28.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
full_flow_users   [  93% ] 1 VUs  28.0s/30s

running (29.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
full_flow_users   [  97% ] 1 VUs  29.0s/30s

running (30.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
full_flow_users   [ 100% ] 1 VUs  30.0s/30s

running (31.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 1 VUs  30s


  █ THRESHOLDS 

    full_flow_duration
    ✓ 'p(95)<10000' p(95)=2532.6

    full_flow_success_rate
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=22.54ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 169     5.421715/s
    checks_succeeded...: 100.00% 169 out of 169
    checks_failed......: 0.00%   0 out of 169

    ✓ login_page HTTP 200
    ✓ login accepted
    ✓ context accepted
    ✓ dashboard_auth_check HTTP 200
    ✓ rme_dashboard HTTP 200
    ✓ rme_visits HTTP 200
    ✓ rme_visit_show HTTP 200
    ✓ rme_medical_record HTTP 200
    ✓ rme_odontogram HTTP 200
    ✓ rme_cashier HTTP 200
    ✓ rme_receivables HTTP 200
    ✓ rme_reports_patients HTTP 200
    ✓ rme_reports_payments HTTP 200

    CUSTOM
    full_flow_duration.............: avg=2397.769231 min=2306    med=2315    max=2538     p(90)=2527.4  p(95)=2532.6 
    full_flow_success_rate.........: 100.00% 13 out of 13

    HTTP
    http_req_duration..............: avg=21.74ms     min=16.74ms med=18.45ms max=226.94ms p(90)=20.78ms p(95)=22.54ms
      { expected_response:true }...: avg=21.74ms     min=16.74ms med=18.45ms max=226.94ms p(90)=20.78ms p(95)=22.54ms
    http_req_failed................: 0.00%   0 out of 351
    http_reqs......................: 351     11.260485/s

    EXECUTION
    iteration_duration.............: avg=2.39s       min=2.3s    med=2.31s   max=2.53s    p(90)=2.52s   p(95)=2.53s  
    iterations.....................: 13      0.417055/s
    vus............................: 1       min=1        max=1
    vus_max........................: 1       min=1        max=1

    NETWORK
    data_received..................: 1.1 MB  36 kB/s
    data_sent......................: 290 kB  9.3 kB/s



running (31.2s), 0/1 VUs, 13 complete and 0 interrupted iterations
full_flow_users ✓ [ 100% ] 1 VUs  30s