docs/stress-test/results/k6/stage5-k6-full-flow-5vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/rme-full-flow-50-users.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m20s max duration (incl. graceful stop):
              * full_flow_users: 5 looping VUs for 1m0s (exec: fullFlow, gracefulStop: 20s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   2% ] 5 VUs  0m01.0s/1m0s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   3% ] 5 VUs  0m02.0s/1m0s

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   5% ] 5 VUs  0m03.0s/1m0s

running (0m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   7% ] 5 VUs  0m04.0s/1m0s

running (0m05.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
full_flow_users   [   8% ] 5 VUs  0m05.0s/1m0s

running (0m06.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
full_flow_users   [  10% ] 5 VUs  0m06.0s/1m0s

running (0m07.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
full_flow_users   [  12% ] 5 VUs  0m07.0s/1m0s

running (0m08.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  13% ] 5 VUs  0m08.0s/1m0s

running (0m09.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  15% ] 5 VUs  0m09.0s/1m0s

running (0m10.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  17% ] 5 VUs  0m10.0s/1m0s

running (0m11.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
full_flow_users   [  18% ] 5 VUs  0m11.0s/1m0s

running (0m12.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
full_flow_users   [  20% ] 5 VUs  0m12.0s/1m0s

running (0m13.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
full_flow_users   [  22% ] 5 VUs  0m13.0s/1m0s

running (0m14.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
full_flow_users   [  23% ] 5 VUs  0m14.0s/1m0s

running (0m15.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
full_flow_users   [  25% ] 5 VUs  0m15.0s/1m0s

running (0m16.0s), 5/5 VUs, 21 complete and 0 interrupted iterations
full_flow_users   [  27% ] 5 VUs  0m16.0s/1m0s

running (0m17.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
full_flow_users   [  28% ] 5 VUs  0m17.0s/1m0s

running (0m18.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
full_flow_users   [  30% ] 5 VUs  0m18.0s/1m0s

running (0m19.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
full_flow_users   [  32% ] 5 VUs  0m19.0s/1m0s

running (0m20.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
full_flow_users   [  33% ] 5 VUs  0m20.0s/1m0s

running (0m21.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
full_flow_users   [  35% ] 5 VUs  0m21.0s/1m0s

running (0m22.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
full_flow_users   [  37% ] 5 VUs  0m22.0s/1m0s

running (0m23.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
full_flow_users   [  38% ] 5 VUs  0m23.0s/1m0s

running (0m24.0s), 5/5 VUs, 36 complete and 0 interrupted iterations
full_flow_users   [  40% ] 5 VUs  0m24.0s/1m0s

running (0m25.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
full_flow_users   [  42% ] 5 VUs  0m25.0s/1m0s

running (0m26.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
full_flow_users   [  43% ] 5 VUs  0m26.0s/1m0s

running (0m27.0s), 5/5 VUs, 41 complete and 0 interrupted iterations
full_flow_users   [  45% ] 5 VUs  0m27.0s/1m0s

running (0m28.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
full_flow_users   [  47% ] 5 VUs  0m28.0s/1m0s

running (0m29.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
full_flow_users   [  48% ] 5 VUs  0m29.0s/1m0s

running (0m30.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
full_flow_users   [  50% ] 5 VUs  0m30.0s/1m0s

running (0m31.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  52% ] 5 VUs  0m31.0s/1m0s

running (0m32.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  53% ] 5 VUs  0m32.0s/1m0s

running (0m33.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
full_flow_users   [  55% ] 5 VUs  0m33.0s/1m0s

running (0m34.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
full_flow_users   [  57% ] 5 VUs  0m34.0s/1m0s

running (0m35.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
full_flow_users   [  58% ] 5 VUs  0m35.0s/1m0s

running (0m36.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
full_flow_users   [  60% ] 5 VUs  0m36.0s/1m0s

running (0m37.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
full_flow_users   [  62% ] 5 VUs  0m37.0s/1m0s

running (0m38.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
full_flow_users   [  63% ] 5 VUs  0m38.0s/1m0s

running (0m39.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
full_flow_users   [  65% ] 5 VUs  0m39.0s/1m0s

running (0m40.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
full_flow_users   [  67% ] 5 VUs  0m40.0s/1m0s

running (0m41.0s), 5/5 VUs, 67 complete and 0 interrupted iterations
full_flow_users   [  68% ] 5 VUs  0m41.0s/1m0s

running (0m42.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
full_flow_users   [  70% ] 5 VUs  0m42.0s/1m0s

running (0m43.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
full_flow_users   [  72% ] 5 VUs  0m43.0s/1m0s

running (0m44.0s), 5/5 VUs, 73 complete and 0 interrupted iterations
full_flow_users   [  73% ] 5 VUs  0m44.0s/1m0s

running (0m45.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
full_flow_users   [  75% ] 5 VUs  0m45.0s/1m0s

running (0m46.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
full_flow_users   [  77% ] 5 VUs  0m46.0s/1m0s

running (0m47.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
full_flow_users   [  78% ] 5 VUs  0m47.0s/1m0s

running (0m48.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
full_flow_users   [  80% ] 5 VUs  0m48.0s/1m0s

running (0m49.0s), 5/5 VUs, 82 complete and 0 interrupted iterations
full_flow_users   [  82% ] 5 VUs  0m49.0s/1m0s

running (0m50.0s), 5/5 VUs, 84 complete and 0 interrupted iterations
full_flow_users   [  83% ] 5 VUs  0m50.0s/1m0s

running (0m51.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
full_flow_users   [  85% ] 5 VUs  0m51.0s/1m0s

running (0m52.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
full_flow_users   [  87% ] 5 VUs  0m52.0s/1m0s

running (0m53.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
full_flow_users   [  88% ] 5 VUs  0m53.0s/1m0s

running (0m54.0s), 5/5 VUs, 91 complete and 0 interrupted iterations
full_flow_users   [  90% ] 5 VUs  0m54.0s/1m0s

running (0m55.0s), 5/5 VUs, 93 complete and 0 interrupted iterations
full_flow_users   [  92% ] 5 VUs  0m55.0s/1m0s

running (0m56.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
full_flow_users   [  93% ] 5 VUs  0m56.0s/1m0s

running (0m57.0s), 5/5 VUs, 96 complete and 0 interrupted iterations
full_flow_users   [  95% ] 5 VUs  0m57.0s/1m0s

running (0m58.0s), 5/5 VUs, 99 complete and 0 interrupted iterations
full_flow_users   [  97% ] 5 VUs  0m58.0s/1m0s

running (0m59.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  98% ] 5 VUs  0m59.0s/1m0s

running (1m00.0s), 5/5 VUs, 102 complete and 0 interrupted iterations
full_flow_users   [ 100% ] 5 VUs  1m00.0s/1m0s

running (1m01.0s), 3/5 VUs, 104 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 5 VUs  1m0s

running (1m02.0s), 2/5 VUs, 105 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 5 VUs  1m0s


  █ THRESHOLDS 

    full_flow_duration
    ✓ 'p(95)<10000' p(95)=3192.7

    full_flow_success_rate
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=79.15ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1391    22.278289/s
    checks_succeeded...: 100.00% 1391 out of 1391
    checks_failed......: 0.00%   0 out of 1391

    ✓ login_page HTTP 200
    ✓ login accepted
    ✓ context accepted
    ✓ dashboard_auth_check HTTP 200
    ✓ rme_dashboard HTTP 200
    ✓ rme_visits HTTP 200
    ✓ rme_visit_show HTTP 200
    ✓ rme_medical_record HTTP 200
    ✓ rme_odontogram HTTP 200
    ✓ rme_cashier HTTP 200
    ✓ rme_receivables HTTP 200
    ✓ rme_reports_patients HTTP 200
    ✓ rme_reports_payments HTTP 200

    CUSTOM
    full_flow_duration.............: avg=2868.224299 min=2651    med=2755    max=4331  p(90)=3029.6  p(95)=3192.7 
    full_flow_success_rate.........: 100.00% 107 out of 107

    HTTP
    http_req_duration..............: avg=39.15ms     min=16.75ms med=35.74ms max=1.1s  p(90)=60.84ms p(95)=79.15ms
      { expected_response:true }...: avg=39.15ms     min=16.75ms med=35.74ms max=1.1s  p(90)=60.84ms p(95)=79.15ms
    http_req_failed................: 0.00%   0 out of 2889
    http_reqs......................: 2889    46.270292/s

    EXECUTION
    iteration_duration.............: avg=2.86s       min=2.65s   med=2.75s   max=4.33s p(90)=3.02s   p(95)=3.19s  
    iterations.....................: 107     1.713715/s
    vus............................: 2       min=2          max=5
    vus_max........................: 5       min=5          max=5

    NETWORK
    data_received..................: 9.2 MB  147 kB/s
    data_sent......................: 2.4 MB  38 kB/s



running (1m02.4s), 0/5 VUs, 107 complete and 0 interrupted iterations
full_flow_users ✓ [ 100% ] 5 VUs  1m0s